/*
* 项目名称： 一个C语言的用例
* 项目功能： 学习使用auto定义变量的用法。
* 项目时间： 2021-09-24
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===============================
# include<stdio.h>
// ================================================================
// 函数名称：main
// 函数功能：学习使用auto定义变量的用法。
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf  
// ================================================================
int main(void)
{
	unsigned short b_u16Num = 2;	
	unsigned short u16Count = 2;	
	for (u16Count = 0; u16Count < 3; u16Count++)
	{
		printf("%d  ", b_u16Num++);
		auto b_u16Num = 1;// 声明auto变量
		printf("%d\n", b_u16Num++);
	}
	
}
