/*
* 项目名称： 一个C语言的用例
* 项目功能： 打印图案
* 项目时间： 2021-08-19
* 项目作者： ZZD
*/
// ===================== 系统头文件 =======================================
# include<stdio.h>
// ========================================================================
// 函数名称：main
// 函数功能：用*打图案C
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：
// ========================================================================
int main(void *arg)
{
    printf("用 * 打印C！\n");// 打印信息 
    printf("用************\n");// 打印图案 
    printf("用*\n");// 打印图案  
    printf("用*\n");// 打印图案  
    printf("用*\n");// 打印图案  
    printf("用*\n");// 打印图案 
    printf("用*\n");// 打印图案  
    printf("用************\n");// 打印图案  
 
    return (0);
}