/*
* 项目名称： 一个C语言的用例
* 项目功能： 利用递归函数调用方式，将所输入的5个字符，以相反顺序打印出来。
* 项目时间： 2021-09-21
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===============================
# include<stdio.h>
// ===================== 函数声明 =================================
int Age(unsigned int InputNumber);
// ================================================================
// 函数名称：main
// 函数功能：递归
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：Age
// ================================================================
int main(void)
{
	unsigned int InputNumber = 0x05;// 输入字符数量
	printf("%d\n",Age(InputNumber));// 打印信息
	return 0;
}
// ================================================================
// 函数名称: Age
// 函数功能: 计算每个人第InputNumber个人的年龄
// 输入参数: InputNumber
// 输出参数: 无
// 全局变量：无
// 调用全局模块: Age 
// ================================================================
int Age(unsigned int InputNumber)
{
	unsigned int PeopleAge = 10;
	if (InputNumber <= 1)
	{
		PeopleAge = 10;// 输入字符
	}
	else
	{
		PeopleAge = Age(InputNumber -1) + 2;// 输入字符
	}
	return PeopleAge;	
}