/*
* 项目名称： 一个C语言的用例
* 项目功能： 寻找兵乓球人员比赛匹配
* 项目时间： 2021-09-20
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===============================
# include<stdio.h>
# include<math.h>
// =================================================================
// 函数名称：main
// 函数功能：寻找兵乓球人员比赛匹配
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：scanf printf
// =================================================================
int main(void)
{
	char b_i32A = 0x0;
	char b_i32B = 0x0;
	char b_i32C = 0x0;
	
	// 循环计算
	for (b_i32A = 'x'; b_i32A <= 'z'; b_i32A++)// 选手A进行循环
	{
		for (b_i32B = 'x'; b_i32B <= 'z'; b_i32B++)// 选手B进行循环
		{
			if(b_i32A != b_i32B)// 选手A、B对手不同
			{
				for (b_i32C = 'x'; b_i32C <= 'z'; b_i32C++)// 选手C进行循环
				{
					if(b_i32A != b_i32C && b_i32B != b_i32C)// 选手A、B、C对手不同
					{
						if(b_i32A != 'x' && b_i32C != 'x'  && b_i32C != 'z')// a说他不和x比,c说他不和x,z比
						{
							printf("a -- %c\t b -- %c\t c-- %c\t", b_i32A, b_i32B, b_i32C);// 输出结果
						}
					}
				}
			}
		}
	}
	return 0;
}