/*
* 工程名称：demo2.3（twofunc.c）
* 开发作者：ZhouWuhen
* 开发日期：2021/08/10
*/
// 系统头文件(标准输入/输出头文件)
#include<stdio.h>
// 函数声明
void butler(void);
// ==========================================================================
// 函数名称： 主函数
// 函数功能：一个C程序实例
// 输入参数：   无
// 输出参数：   无
// 调用全局变量： 
// 调用全局模块：
// ==========================================================================
int main(void)
{
    printf("I will summon the butler function.\n"); // 打印信息
    butler();// 调用函数
    printf("Yes, Bring me some tea and writeable DVDs.\n");

    return (0);
}
// ==========================================================================
// 函数名称： butler
// 函数功能：打印信息
// 输入参数：   无
// 输出参数：   无
// 调用全局变量：无 
// 调用全局模块：无
// ==========================================================================
void butler(void)
{
    printf("you rang, sir?\n");//打印信息
}