/*
* 项目名称： 一个C语言的用例
* 项目功能： 比较两个字符串的最大相同单词
* 项目时间： 2021-08-26
* 项目作者： ZZD
*/
// ===================== 系统头文件 =======================================
# include<stdio.h>
# include<math.h>
// ========================================================================
// 函数名称：main
// 函数功能：比较两个字符串的最大相同单词
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：
// ========================================================================
#include<stdio.h>
#include<string.h>
int testarray(unsigned short testA[])
{
	for (size_t i = 0; i < 5; i++)
	{
		printf("test[%d] is %d\n", i, testA[i]);
	}
	
	return 0;
}
int main(void)
{
	unsigned short test[5] = {2, 5, 6, 4, 10};
	testarray(test);
	return 0;		
}