/*
* 工程名称：practice(2.12.8)
* 工程功能：练习C程序调用其他函数
* 开发作者："ZZD"
* 开发日期：2021/08/11
*/
// 系统头文件(标准输入/输出头文件)
#include<stdio.h> 
// 函数声明
void two(void);
void one_three(void);
// ==========================================================================
// 函数名称： 主函数
// 函数功能：练习调用其他函数
// 输入参数：   无
// 输出参数：   无
// 调用全局变量：无 
// 调用全局模块：无
// ==========================================================================
int main(void)
{
    printf("starting now: \n");// 打印程序开始信息
    one_three();// 调用函数
    printf("done! \n");// 打印程序结束信息
}
// ==========================================================================
// 函数名称： 显示函数2
// 函数功能：打印信息
// 输入参数：   无
// 输出参数：   无
// 调用全局变量：无 
// 调用全局模块：无
// ==========================================================================
void one_three(void)
{
    printf("one\n"); // 打印信息
    two();// 调用其他函数
    printf("three\n"); // 打印信息

}
// ==========================================================================
// 函数名称： 显示函数1
// 函数功能：打印信息
// 输入参数：   无
// 输出参数：   无
// 调用全局变量：无 
// 调用全局模块：无
// ==========================================================================
void two(void)
{
    printf("two\n"); // 打印信息
}