/*
* 项目名称： 一个C语言的用例
* 项目功能： 计算4个数字有多少无重复数字三位数组合
* 项目时间： 2021-08-18
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===================================
# include<stdio.h>
// ========================================================================
// 函数名称：main
// 函数功能：计算4个数字有多少无重复数字三位数组合
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：无
// ========================================================================
int main(void *arg)
{
    int best = 0, ten = 0, one = 0;// 定义变量用来保存三位数的百、十、个位
    int sum[64];// 定义数组
    int count = 0;// 定义计数变量
    for(best = 1; best < 5; best++)// 百位循环
    {
        for(ten = 1; ten < 5; ten++)// 十位循环
        {
            for(one = 1; one < 5; one++)// 个位循环 
            {
                if((best == ten)||(best == one)||(ten == one))// 判断是否有重复位
                {

                }
                else
                {
                    sum[count] = ((best * 100) + (ten * 10) + one);// 将满足条件部分保存
                    printf("sum[%d] is: %d\n",  count, sum[count]);// 打印信息
                    count++;
                }               
            }
        }
    }
    return (0);
}