/*
* 项目名称： 一个C语言的用例
* 项目功能： 时间举例2
* 项目时间： 2021-11-28
* 项目作者： ZZD
*/
// ===================== 宏定义声明 ===============================
// ===================== 头文件声明 ===============================
#include<stdio.h>
#include<time.h>
// ===================== 函数声明 ==================================
// =================================================================
// 函数名称：main
// 函数功能：入口函数
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf time localtime asctime
// =================================================================
int main(void)
{
    time_t start, end;
    start = time(NULL);// 获取开始时间
    for (size_t i = 0; i < 1000; i++)
    {
        printf("\n");
    }
    end = time(NULL);// 获取结束时间

    printf("%f\n", difftime(end, start));// 打印信息

    return 0;
}