/*
* 项目名称： 一个C语言的用例
* 项目功能： 读取7个数（1—50）的整数值，每读取一个值，程序打印出该值个数的 ＊
* 项目时间： 2021-11-28
* 项目作者： ZZD
*/
// ===================== 宏定义声明 ===============================
#define M 5
// ===================== 头文件声明 ===============================
#include<stdio.h>
#include<stdlib.h>
// ===================== 函数声明 ==================================
// =================================================================
// 函数名称：main
// 函数功能：入口函数
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf
// =================================================================
int main()
{
    int a[M]={1,2,3,4,5};
    int i,j,t;
    i=0;j=M-1;
    while(i<j)
    {
        t=*(a+i);
        *(a+i)=*(a+j);
        *(a+j)=t;
        i++;j--;
    }
    for(i=0;i<M;i++) 
    {
        printf("%d\n",*(a+i));
    }

}