/*
* 项目名称： 一个C语言的用例
* 项目功能： 练习调用函数
* 项目时间： 2021-09-22
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===============================
# include<stdio.h>
// ===================== 函数声明 ===============================
void _HelloWorld(void);
void _HelloWorldThree(void);
// ================================================================
// 函数名称：main
// 函数功能：练习调用函数
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：
// ================================================================
int main(void)
{
	_HelloWorldThree();// 调用函数
}
// ==============================================================
// 函数名称：_HelloWorld
// 函数功能：打印“Hello world”
// 输入参数: 无
// 输出参数：无
// 全局变量：无
// 调用模块：printf
// ===============================================================
void _HelloWorld(void)
{
	printf("Hello world\n");// 打印信息
}
// ==============================================================
// 函数名称：_HelloWorldThree
// 函数功能：打印“Hello world” 3次
// 输入参数: 无
// 输出参数：无
// 全局变量：无
// 调用模块：printf _HelloWorld
// ===============================================================
void _HelloWorldThree(void)
{
	unsigned int b_count = 0x0;
	// 打印三次
	for(b_count = 0; b_count < 3; b_count ++)
	{
		printf("Hello world\n");// 打印信息
	}
}