/*
* 项目名称： 一个C语言的用例
* 项目功能： 练习使用按位'&'。
* 项目时间： 2021-09-27
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===============================
# include<stdio.h>
// ================================================================
// 函数名称：main
// 函数功能：练习使用按位'&'。
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf 
// ================================================================
int main(void)
{
	int i32Ret =-1;
	unsigned short u16InputA = 0x77;
	unsigned short u16InputB = 0x00;
	
	u16InputA = u16InputA & 0x03;// 按位与运算
	printf("0x%04x\n",u16InputA);// 打印信息

	u16InputB = 0x51;
	u16InputB = u16InputB & 0x04;// 按位与运算
	printf("0x%04x\n",u16InputB);// 打印信息

	return 0;
}
