/********************************************************************
* 项目名称： 一个C语言的用例
* 项目功能： 画点
* 项目时间： 2021-11-12
* 项目作者： ZZD
********************************************************************/
#include <stdio.h>
#include "graphics.h"

// ******************宏定义声明***********************************
// ================================================================
// 函数名称：main
// 函数功能：画点
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf 
// ================================================================
int main(int arg,char *argv[]) 
{
    int i32Drive = 0;
    int i32Mode  = 0;

    i32Drive = VGA;
    i32Mode  = VGAHI;
    initgraph(&i32Drive, &i32Mode, "");
    setcolor(YELLOW);

    for(int i = 50; i <= 230; i+=20)
    {
        for(int j = 0; j <= 230; j++)
        {
            putpixel(i, j, YELLOW);
        }

    }

    for(int j = 50; j <= 230; j+=20)
    {
        for(int i = 50; i <= 230; i++)
        {
            putpixel(i, j, YELLOW);
        }

    }
    getchar();
    return 0;  
}

