/*
* 项目名称： 一个C语言的用例
* 项目功能： 学习使用auto定义变量的用法。
* 项目时间： 2021-09-24
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===============================
# include<stdio.h>
// ===================== 定义全局变量 ===============================
unsigned short u16NumberA = 0;
unsigned short u16NumberB = 4;
unsigned short u16NumberC = 0;
// ===================== 函数声明 ===============================
void add();
// ================================================================
// 函数名称：main
// 函数功能：学习使用auto定义变量的用法。
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf  
// ================================================================
int main(void)
{
	u16NumberA = u16NumberB = 4;
	add();
	printf("%d\n", u16NumberC);	
	return 0;
}
// ================================================================
// 函数名称：add
// 函数功能：求和
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：  
// ================================================================
void add()
{
	unsigned short u16NumberA = 3;
	u16NumberC = u16NumberA + u16NumberB;// 求和
}