/*
* 项目名称： 一个C语言的用例
* 项目功能： 传递结构体变量
* 项目时间： 2021-11-28
* 项目作者： ZZD
*/
// ===================== 头文件声明 ===============================
#include<stdio.h>
#include<string.h>
#include<stdlib.h>
// ===================== 全局声明 ==================================
struct student
{
    int  x;
    char c;
}student;
// ===================== 函数声明 ==================================
void student_func(struct student student);
// =================================================================
// 函数名称：main
// 函数功能：入口函数
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf
// =================================================================
int main(void)
{
    int i32Ret = -1;

    student.x = 3;
    student.c = 'a';

    student_func(student);// 调用函数

    printf("%c %d\n", student.c, student.x);
    return 0;
}
// =================================================================
// 函数名称：main
// 函数功能：向函数传递结构体
// 输入参数：student
// 输出参数：无
// 全局变量：无
// 调用模块：无
// =================================================================
void student_func(struct student student)
{
    student.x = 20;
    student.c = 'y';
}