/*
* 项目名称： 一个C语言的用例
* 项目功能： 练习调用函数
* 项目时间： 2021-09-22
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===============================
# include<stdio.h>
// ===================== 全局宏定义 ===============================
#define swap(x,y)    x = x^y, y = x^y, x = x^y
// ===================== 函数声明 ===============================
void _ExtractStr(char *str);
// ===================== 全局变量 ===============================
char g_str[256]; // 缓存字符串
// ================================================================
// 函数名称：main
// 函数功能：练习调用函数
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：
// ================================================================
int main(void)
{
	int i32Ret = -1;

	printf("please input str : \n");
	i32Ret = scanf("%s", g_str);
	if (i32Ret <= 0)
	{
		printf("str input error\n");
	}
	_ExtractStr(g_str);	// 调用字符串反向输出函数
	printf("%s \n", g_str);// 输出结果
}
// ==============================================================
// 函数名称：_ExtractStr
// 函数功能：将字符串反向输出
// 输入参数: str ： 字符串
// 输出参数：无
// 全局变量：无
// 调用模块：printf
// ===============================================================
void _ExtractStr(char *str)
{
	unsigned int b_count = 0x0;
	unsigned int b_StrLength = 0x0;
	while(*str != '\0')
	{
		b_StrLength ++;
		str++;// 指针偏移加1
	}
	for (b_count = 0; b_count < b_StrLength/2; b_count++)
	{
		swap(*(str - 1 - b_count), *(str - b_StrLength + b_count)) ;// 交换首尾字符
	}
	str -= b_StrLength; //指针回到起点
}
