/********************************************************************
* 项目名称： 一个C语言的用例
* 项目功能： 画图 ellipse rectangle.
* 项目时间： 2021-11-13
* 项目作者： ZZD
********************************************************************/
#include <stdio.h>
#include "graphics.h"

// ******************宏定义声明***********************************
// ================================================================
// 函数名称：main
// 函数功能：画图 ellipse rectangle.
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块： 
// ================================================================
int main(int arg,char *argv[]) 
{
    int i32Drive = 0;
    int i32Mode  = 0;
    int top = 50, left = 20, right = 50;

    // 初始化图形系统
    i32Drive = VGA;
    i32Mode  = VGAHI;
    initgraph(&i32Drive, &i32Mode, "");
    setcolor(YELLOW);

    for (size_t i = 0; i < 20; i++)
    {
        ellipse(250, 250, 0, 360, right, left);// 画椭圆
        ellipse(250, 250, 0, 360, 20, top);// 画椭圆
        rectangle(20 - 2*i, 20 - 2*i, 10*(i + 2), 10*(i + 2));// 画矩形框图
        right+=5;
        left+=5;
        top+=10;
    }

    getchar();
    return 0;  
}

