/*
* 项目名称： 一个C语言的用例
* 项目功能： 计算不同利润时的奖金
* 项目时间： 2021-08-17
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===================================
# include<stdio.h>
// ========================================================================
// 函数名称：main
// 函数功能：计算某公司不同利润时的奖金
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：无
// ========================================================================
int main(void *arg)
{
    float i = 0;// 保存键盘当月利润单位万元
    float bonus = 0;// 奖金

    // 获取键盘输入利润，单位“万元”
    printf("please input profits:\n");
    scanf("%f", &i);
    
    if(i <= 10.00)
    {
        bonus = i * 0.1;// 计算利润小于10万时的奖金
    }
    else if(10.00 < i <= 20.00)
    {
        bonus = ((i-10) * 0.075) + 1;// 计算利润大于10万小于20万时的奖金
    }
    else if(20.00 < i <= 40.00)
    {
        bonus = ((i-20) * 0.05) + 1.75; // 计算利润大于20万小于40万时的奖金
    }
    else if(40.00 < i <= 60.00)
    {
        bonus = ((i-40) * 0.03) + 2.75; // 计算利润大于40万小于60万时的奖金
    }
    else if(60.00 < i <= 100.00)
    {
        bonus = ((i-60) * 0.015) + 3.35; // 计算利润大于60万小于100万时的奖金
    }
    else
    {
        bonus = ((i-100) * 0.01) + 3.95; // 计算利润大于100万的奖金                
    }
    printf("this month bonus is : %0.2f\n ", bonus);// 打印信息
    return (0);
}