/*
* 工程名称：demo2.4（nogood.c）
* 工程功能：练习调试C程序
* 开发作者：ZhouWuhen
* 开发日期：2021/08/10
*/
// 系统头文件(标准输入/输出头文件)
#include<stdio.h>
// ==========================================================================
// 函数名称： 主函数
// 函数功能：一个C程序实例
// 输入参数：   无
// 输出参数：   无
// 调用全局变量： 
// 调用全局模块：
// ==========================================================================
int main(void)
{
    int n, n2, n3;
    // 该程序有多处错误
    n = 5;
    n2 = n*n;
    // n3 = n2 * n2;
    n3 = n * n2; 
    printf("n = %d, n squared = %d, n cubed = %d\n", n, n2, n3);

    return (0);
}
