/*
* 项目名称： 一个C语言的用例
* 项目功能： 学习static定义静态变量的用法。
* 项目时间： 2021-09-24
* 项目作者： ZZD
*/
// ===================== 系统头文件 ===============================
# include<stdio.h>
// ===================== 函数声明 ===============================
void Fun(void);
// ================================================================
// 函数名称：main
// 函数功能：学习static定义静态变量的用法。
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf Fun 
// ================================================================
int main(void)
{
	unsigned int u32Count = 0;
	for(u32Count = 0; u32Count < 3; u32Count ++)
	{
		Fun();// 调用函数
	}
}
// ================================================================
// 函数名称：
// 函数功能：学习static定义静态变量的用法。
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf static 
// ================================================================
void Fun(void)
{
	int i32Count = 0x0;// 非静态变量
	static int i32staticCount = 0x0;// 静态变量
	printf("%d\n",i32Count++);// 打印非静态变量
	printf("%d\n",i32staticCount++);// 打印静态变量
}