/*
* 项目名称： 一个C语言的用例
* 项目功能： 找出程序的问题
* 项目时间： 2021-11-26
* 项目作者： ZZD
*/
// ===================== 头文件声明 ===============================
#include<stdio.h>
#include<stdlib.h>
struct man{
    char name[20];
    int  age;
}
person[3]={"li",18,"wang",25,"sun",22};
// ===================== 函数声明 ===============================
// =================================================================
// 函数名称：main
// 函数功能：找出程序的问题
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf
// =================================================================
int main(void)
{
    struct man *q,*p;
    int i,m=0;
    p=q=person;
    for(i=0;i<3;i++)
    {
        if(m<(p+i)->age)
        {
            m=(p+i)->age;
            q=(p+i);
        }
        // p++;// 当循环结束时指针指向的位置为结构体数组最后一位的后一位（该区域未知）
    }
    printf("%s %d\n",q->name,q->age);
    return 0;
}