/*
* 项目名称： 一个C语言的用例
* 项目功能： 将八进制转换成十进制
* 项目时间： 2021-11-27
* 项目作者： ZZD
*/
// ===================== 头文件声明 ===============================
#include<stdio.h>
#include<stdlib.h>
#include<string.h>
// ===================== 函数声明 ==================================
// =================================================================
// 函数名称：main
// 函数功能：将八进制转换成十进制
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf
// =================================================================
int main(void)
{
    /*变量初始化*/
    char s[20];
    unsigned short u16Count = 0x0;
    unsigned short u16NUmberHex = 0x0;

    // 获取输入字符串
    gets(s);
    while (s[u16Count]!= '\0')
    {
        u16NUmberHex = u16NUmberHex * 8 + (s[u16Count] - '0');// 将八进制去转化成10进制
        u16Count ++;
    } 
    printf("%d\n",u16NUmberHex);
    return 0;
}
