/*
* 项目名称： 一个C语言的用例
* 项目功能： 排序
* 项目时间： 2021-08-19
* 项目作者： ZZD
*/
// ===================== 系统头文件 =======================================
# include<stdio.h>
// ===================== 宏定义声明 =======================================
#define swap(X,Y)  (X =(X^Y), Y =(X^Y), X =(X^Y)) // 带参宏定义声明交换函数
// ========================================================================
// 函数名称：main
// 函数功能：输入三个整数然后进行排序
// 输入参数：X Y Z 由SCANF函数输入
// 输出参数：无
// 全局变量：无
// 调用模块：printf scanf swap
// ========================================================================
int main(void *arg)
{
    int X = 0, Y = 0, Z = 0, temp = 0;
    printf("please input 3 numbers:\n");// 打印信息
    scanf("%d %d %d", &X, &Y, &Z);// 键盘输入年、月、日
    if(X > Y )// 若X大于Y则交换X、Y
    {
        swap(X,Y);   
    }
    if(X > Z )// 若X大于Z则交换X、Z
    {
        swap(X,Z);
    } 
    if (Y > Z )// 8520若Y大于Z则交换Y、Z
    {
        swap(Y ,Z );
    }   
    printf("%d %d %d\n", X, Y, Z);// 打印信息  
    return (0);
}