/*
* 工程名称：practice(2.12.5)
* 工程功能：练习C程序调用其他函数
* 开发作者："ZZD"
* 开发日期：2021/08/11
*/
// 系统头文件(标准输入/输出头文件)
#include<stdio.h> 
// 函数声明
void br(void);
void ic(void);
// ==========================================================================
// 函数名称： 主函数
// 函数功能：一个编程练习
// 输入参数：   无
// 输出参数：   无
// 调用全局变量：无 
// 调用全局模块：无
// ==========================================================================
int main(void)
{
    printf("Brazil， Russia， India， China \n");// 打印信息
    br();// 调用打印函数
    ic();// 调用另一个打印函数
    return (0);
}
// ==========================================================================
// 函数名称： 打印函数1
// 函数功能：打印信息
// 输入参数：   无
// 输出参数：   无
// 调用全局变量：无 
// 调用全局模块：无
// ==========================================================================
void br(void)
{
    printf("Brazil， Russia \n");
}
// ==========================================================================
// 函数名称： 打印函数2
// 函数功能：打印信息
// 输入参数：   无
// 输出参数：   无
// 调用全局变量：无 
// 调用全局模块：无
// ==========================================================================
void ic(void)
{
    printf("India， China \n");
}