/*
* 工程名称：practice(2.12.7)
* 工程功能：练习C程序调用其他函数
* 开发作者："ZZD"
* 开发日期：2021/08/11
*/
// 系统头文件(标准输入/输出头文件)
#include<stdio.h> 
// 函数声明
void smile(void);
// ==========================================================================
// 函数名称： 主函数
// 函数功能：练习调用其他函数
// 输入参数：   无
// 输出参数：   无
// 调用全局变量：无 
// 调用全局模块：无
// ==========================================================================
int main(void)
{
    int i = 0; // 定义变量用于循环
    for(i = 0; i < 3; i++)
    {
        smile();// 调用函数    
    }
    printf("\n");
    for(i = 0; i < 2; i++)
    {
        smile();// 调用函数    
    }
    printf("\n");
    smile();// 调用函数
    printf("\n");
}
// ==========================================================================
// 函数名称： 主函数
// 函数功能：打印信息
// 输入参数：   无
// 输出参数：   无
// 调用全局变量：无 
// 调用全局模块：无
// ==========================================================================
void smile(void)
{
    printf("smile! "); // 打印信息
}