/********************************************************************
* 项目名称： 一个C语言的用例
* 项目功能： 画椭圆ellipse（在TC中实现）.
* 项目时间： 2021-11-13
* 项目作者： ZZD
********************************************************************/
#include <stdio.h>
#include "graphics.h"

// ******************宏定义声明***********************************
// ================================================================
// 函数名称：main
// 函数功能：画椭圆ellipse（在TC中实现）.
// 输入参数：无
// 输出参数：无
// 全局变量：无
// 调用模块：printf 
// ================================================================
int main(int arg,char *argv[]) 
{
    int i32Drive = 0;
    int i32Mode  = 0;
    int x  = 360, y = 160;
    int top,bottom;

    i32Drive = VGA;
    i32Mode  = VGAHI;
    initgraph(&i32Drive, &i32Mode, "");
    setcolor(YELLOW);

    top    = y - 30;
    bottom = y - 30;

    for (size_t i = 0; i < 20; i++)
    {
        ellipse(x, y, 0, 360, top, bottom);// 画椭圆
        top -= 5;
        bottom+=5;
    }

    getchar();
    return 0;  
}

